In [1]:
import pandas as pd
name = 'SBIN'

In [2]:
sym = 'b' * (10 - len(name)) + name
print(sym)

bbbbbbSBIN

In [16]:
df = pd.read_csv('CASH_Trades_03072018.DAT', header = None)

In [17]:
df.head()

                                                   0
0  RMCASH201807030000000179631223195167bbAARTIIND...
1  RMCASH201807030000000279631223195168bbbbbbABAN...
2  RMCASH201807030000000379631223195169bbbbbbABAN...
3  RMCASH201807030000000479631223195170bbbbbbABAN...
4  RMCASH201807030000000579631223195171bbbbbbABAN...

In [18]:
df = df[df[0].str[36:46] == sym]

In [19]:
df.head()

                                                         0
7398209  RMCASH201807037500007279631223195044bbbbbbSBIN...
7398210  RMCASH201807037500007379631223195045bbbbbbSBIN...
7398211  RMCASH201807037500007479631223195046bbbbbbSBIN...
7398212  RMCASH201807037500007579631223195047bbbbbbSBIN...
7398213  RMCASH201807037500007679631223195048bbbbbbSBIN...

In [20]:

df['trade_time'] = df[0].str[22:36]                      # 22:36
df['price'] = df[0].str[48:56].astype(int) / 100        # 48:56 -> int /100
df['quantity'] = df[0].str[56:64].astype(int)           # 56:64 -> int
df['buy_order_number'] = df[0].str[64:80]               # 64:80
df['sell_order_number'] = df[0].str[82:98]              # 82:98

In [21]:
df = df.drop(columns=[0])

In [22]:
df.to_parquet(f'{name}_trade.parquet')

In [ ]:
df.head()

             trade_time  price  quantity  buy_order_number sell_order_number
7398209  79631223195044  259.6        25  1300000000053655  1300000000057907
7398210  79631223195045  259.6         5  1300000000050079  1300000000057907
7398211  79631223195046  259.6         4  1300000000050265  1300000000057907
7398212  79631223195047  259.6         3  1300000000050535  1300000000057907
7398213  79631223195048  259.6         2  1300000000051136  1300000000057907

In [24]:
len(df)

92643